app/controllers/blogs_controller.rb

  def index
    @blogs = Blog.includes(:user).order("created_at DESC")
---
SELECT `blogs`.* FROM `blogs` ORDER BY created_at DESC

  def create
    Blog.create(blog_params)
---
INSERT INTO `blogs` (`user_id`, `text`, `created_at`, `updated_at`) VALUES (5, 'こんにちはあああああああああ', '2019-01-29 10:30:33', '2019-01-29 10:30:33')

  def destroy
    blog = Blog.find(params[:id])
    blog.destroy if blog.user_id == current_user.id
---
SELECT  `blogs`.* FROM `blogs` WHERE `blogs`.`id` = 1 LIMIT 1
DELETE FROM `blogs` WHERE `blogs`.`id` = 1

  def edit
    @blog = Blog.find(params[:id])
---
SELECT  `blogs`.* FROM `blogs` WHERE `blogs`.`id` = 2 LIMIT 1

  def update
    blog = Blog.find(params[:id])
    blog.update(blog_params) if blog.user_id == current_user.id
---
SELECT  `blogs`.* FROM `blogs` WHERE `blogs`.`id` = 2 LIMIT 1
UPDATE `blogs` SET `text` = 'ああああああいいい', `updated_at` = '2019-01-29 10:37:12' WHERE `blogs`.`id` = 2

  def show
    @blog = Blog.find(params[:id])
    @comments = @blog.comments.includes(:user)
---
SELECT  `blogs`.* FROM `blogs` WHERE `blogs`.`id` = 2 LIMIT 1
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 5 LIMIT 1