app/models/user.rb

  def self.find_for_facebook_oauth(auth, signed_in_resource=nil)
    user = User.where(:provider => auth.provider, :uid => auth.uid).first
    unless user
      user = User.create(name:     auth.extra.raw_info.name,
                         provider: auth.provider,
                         uid:      auth.uid,
                         email:    auth.info.email,
                         password: Devise.friendly_token[0,20]
                        )
---
SELECT  `users`.* FROM `users` WHERE `users`.`provider` = 'facebook' AND `users`.`uid` = '1493875564077736' ORDER BY `users`.`id` ASC LIMIT 1
INSERT INTO `users` (`email`, `encrypted_password`, `created_at`, `updated_at`, `provider`, `uid`, `name`) VALUES ('yarakasi-men_tansio.0922@softbank.ne.jp', '$2a$11$PffuefGP.4mKvJ08u4949eKFI0t/ofqxO0ouivaazgHNi2pzu5.Sq', '2019-01-29 06:55:19', '2019-01-29 06:55:19', 'facebook', '1493875564077736', 'Yuhei Tanno')